export const TASKS_STRUCTURE = {
  1: {
    title: 'Разветвляющиеся алгоритмы',
    subtopics: {
      1: {
        title: 'Логические выражения',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
        },
      },
      2: {
        title: 'Условные операторы',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
          3: { title: 'Высокий' },
        },
      },
      3: {
        title: 'Оператор выбора вариантов',
        levels: {
          1: { title: 'Базовый' },
        },
      },
    },
  },
  2: {
    title: 'Циклические алгоритмы',
    subtopics: {
      1: {
        title: 'Оператор цикла с параметром',
        levels: {
          1: { title: 'Базовый' },
        },
      },
      2: {
        title: 'Операторы цикла с предусловием и постусловием',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
          3: { title: 'Высокий' },
        },
      },
    },
  },
  3: {
    title: 'Массивы',
    subtopics: {
      1: {
        title: 'Одномерные массивы',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
          3: { title: 'Высокий' },
        },
      },
      2: {
        title: 'Двумерные массивы',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
          3: { title: 'Высокий' },
        },
      },
    },
  },
  4: {
    title: 'Особые типы данных',
    subtopics: {
      1: {
        title: 'Символьный тип данных',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
          3: { title: 'Высокий' },
        },
      },
      2: {
        title: 'Строковый тип данных',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
          3: { title: 'Высокий' },
        },
      },
    },
  },
  5: {
    title: 'Файлы',
    subtopics: {
      1: {
        title: 'Текстовые файлы',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
          3: { title: 'Высокий' },
        },
      },
      2: {
        title: 'Бинарные файлы',
        levels: {
          1: { title: 'Базовый' },
          2: { title: 'Средний' },
          3: { title: 'Высокий' },
        },
      },
    },
  },
};
